---
kind: type
id: T:Autodesk.Revit.Exceptions.UnauthenticatedException
source: html/e94e82b6-4345-48ca-7be9-fd8393b0ff7f.htm
---
# Autodesk.Revit.Exceptions.UnauthenticatedException

## Syntax (C#)
```csharp
[SerializableAttribute]
public class UnauthenticatedException : ApplicationException
```